# Первое задание из 2 части
subject = {
    # Первое значение - первое задание из 2 части
    # Второе значение - номер последнего задания
    'Математика': [13, 19],
    'Русский язык': [27, 28],
    'Обществознание': [17, ],
    'Биология': [22, 28],
    'Физика': [21, 26],
    'Химия': [29, 34],
    'География': [22, 29],
    'История': [13, 21],
    'Английский язык': [37, 42]
}

task_list = {
    'Математика': {
        1: 'Планиметрия',
        2: 'Векторы',
        3: 'Стереометрия',
        4: 'Начала теории вероятностей',
        5: 'Вероятности сложных событий',
        6: 'Простейшие уравнения',
        7: 'Вычисления и преобразования',
        8: 'Производная и первообразная',
        9: 'Задачи с прикладным содержанием',
        10: 'Текстовые задачи',
        11: 'Графики функций',
        12: 'Наибольшее и наименьшее значение функций',
        13: 'Уравнения',
        14: 'Стереометрическая задача',
        15: 'Неравенства',
        16: 'Финансовая математика',
        17: 'Планиметрическая задача',
        18: 'Задача с параметром',
        19: 'Числа и их свойства'
    },
    'История': {
        1: 'Систематизация исторической информации: соответствие',
        2: 'Определение последовательности исторических событий',
        3: 'Систематизация исторической информации: соответствие',
        4: 'Работа с информацией, представленной в форме таблицы',
        5: 'Знание исторических деятелей VIII – начала XXI в',
        6: 'Анализ текстовых исторических источников',
        7: 'Систематизация исторической информации: соответствие',
        8: 'Работа с изображениями ВОВ',
        9: 'Анализ исторических карт, схем',
        10: 'Анализ исторических карт, схем',
        11: 'Соответствие информации из исторической карты и текста',
        12: 'Анализ исторических карт, схем',
        13: 'Определение характеристик исторического источника',
        14: 'Поиск исторической информации',
        15: 'Анализ иллюстративного материала',
        16: 'Анализ иллюстративного материала',
        17: 'Работа с историческим источником',
        18: 'Установление причинно-следственных связей',
        19: 'Проверка знаний исторических понятий',
        20: 'Сравнение исторических событий',
        21: 'Аргументация с использованием исторических фактов'
    }
}
